{
    "version": "https://jsonfeed.org/version/1",
    "title": "cogitare",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": null,
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "Rohan",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "http://localhost:4000/2025/03/12/apriori",
            "title": "Children think in first principles",
            "summary": null,
            "content_text": "BackgroundThe other day when I was reading an article on reasoning from first principles, I came across this statement which I found interesting-  Children instinctively think in first principles.Dwelling on this, I realised how much I have begun to reason by analogy lately (and use my preconceived notions), which I believe, has hindered my ability to have a confident outlook on approaching problems. And in hindsight does make me feel a little incompetent, because it shows that I am trying to approach a problem by trying to depend on some prior experience, rather than having a complete understanding of each bit and constructing the solution myself.Do not acceptA first principle is a statement which cannot be derived from another statement, meaning an absolute truth which cannot be broken down further; the mathematical equivalent being postulates. Reasoning by first principles is basically a problem solving methodology that forces a person to start from absolute zero, not relying on any assumptions, analogies and experiences. In simple terms, questioning everything and getting to the root of the problem.I remember pestering my parents by asking them questions about anything and everything that caught my attention. I had a phase when I was about five where all I did was ask non-stop whys and hows for every little thing. This might be a naive example of first principles thinking, but it still (kind of) proves that I wanted to get to the bottom of something. While you don’t have to pester your friends and family with a barrage of whys as an adult, I think there are a few important takeaways from this inquisitive nature of children. Firstly, the more obvious one being the need to understand purpose of doing something, or something existing. Secondly, intellectual humility. I believe this applies more for older individuals, as young children have no fear of looking ‘stupid’ in admitting they do not know something (as evidenced by their bombardment of a hundred whys per day). But this way of approaching things like a child gives a greater mastery over whatever problem you are trying to tackle, considering the fact that you have a clear picture on the fundamentals, and forces the mind to think logically.One situation where first principles thinking was taught was in high school mathematics. The proofs we had to deal with in Euclidian Geometry is a good example of utilising the first principles thinking, where we were only given Euclid’s postulates and axioms. I remember I was pretty decent at high school math, and found the theorems very interesting to prove using just the foundations (first principles). Just as there are multiple ways to solve the same math question, the idea of breaking down a problem into a set of the tiniest rules possible also gives way to solve it using more than one method or approach, introducing fresh perspectives, rather than fixating on old experiences which serve as a limiter in this situation. This also leads to the discussion of experience hindering innovation which I will touch upon in the next section.I believe one of the best applications of first principles thinking is by René Descartes, the famous quote, cogito, ergo sum in his Discourse on the Method, which serves as a foundational statement in Western philosophy. He tries to tackle skepticism by finding an absolute truth which is irrefutable. He does so by doubting everything around him, the World, its people, nature, environment, and his own body. He starts by imagining a situation where his thoughts are being manipulated into thinking all these things exist in his mind, and aren’t real. By refuting it all, he removes all preconceived notions, and starts from a blank slate. I’ll let him explain the rest:  But immediately upon this I observed that, whilst I thus wished to think that all was false, it was absolutely necessary that I, who thus thought, should be something; And as I observed that this truth, I think, therefore I am, … I concluded that I might, without scruple, accept it as the first principle of the philosophy of which I was in search.While first principles is a popular technique used in mathematics and physics (ab initio methods), it is used in various forms of arts as well. I think one of the places where you can see this, but not as discernible is with music. A cover or a remix is a modified version of a song which already exists, and an original song with a distinct style is a newly invented sound manages to scratch an itch in the brain. A good artist is someone who can create songs on their own by mastering music theory fundamentals like rhythm, melody, pitch, etc. Rather than relying on getting inspired (i.e: ripping off) from another person they tend to create their own art. Another popular example is a chef versus a cook. A cook relies on recipes, and might make a few variations and improve it slightly, while a chef is someone who has a complete understanding of the ingredients and its sciences, and can create new recipes from scratch.I think one of the best advices I’ve got in college from a professor of mine was to ‘never accept’ what he teaches without verifying it ourselves. This is an important philosophy when learning something new. Accepting something at face value without knowing the nuances and the whys and hows was something he was heavily against. We were told to ‘not trust’ him every time he introduced a new topic and reached the conclusion. Generally the class (Automata Theory, for those interested) was a discussion in which we started with absolute facts and worked our way to prove something or find a solution. This distinct style of teaching in which the professor, rather than just stating the theorems and its proofs, started off with the same level of knowledge as the students, and the discussions helped introduce a lot of new directions to approach a problem. (I’ve still not forgotten most of the concepts because I am so fundamentally clear about it.)Beginner’s Mind ParadoxThe more you know about a subject, the more likely you are to close your mind to further learning (see: Einstellung effect). This paradox implies that beginner is more likely to be inventive as they are more likely to be open to trying things which are either considered unconventional, or haven’t been thought of before. So, innovation often stems from those who are ignorant of established rules and guidelines. And as we age, we tend to become conformists (probably due to experience). I think this also carries over in education, where as you grow older, the vastness of information and the complexity of the subjects we learn tend to be intimidating. But in reality, all complex systems can be reverse engineered into simple truths. And though this takes more effort, realising the simple beauties of things you’re learning tends to make you appreciate the subject more. Children always have a strong grasp over things they want to learn, and are persistent to get to the bottom of it. They focus on the simple things among the complex chaos more clearly than adults, and this comes to them intuitively. This is a trait that I believe is fully developed in everyone since birth. They appreciate the simplicity and do not get distracted by the difficulty, social implications, failure rate - things which are irrelevant and always lead to bias and narrow-mindedness, present in most if not all adults. Skills you have learned as a child are seldom forgotton even after many years. It’s almost as if you know it instinctively. The way to open up your mind again is use first principles thinking, and do not let bias take over.The New York Times published an editorial on October 9th, 1903, titled: FLYING MACHINES WHICH DO NOT FLY. It poked fun at the unsuccessful attempt to create the first working manned heavier-than-air aircraft by Samuel Langley, which had crashed just two days before this editorial was published, leading to this quote-  Hence, if it requires, say, a thousand years to fit for easy flight a bird which started with rudimentary wings, or ten thousand for one with started with no wings at all and had to sprout them ab initio, it might be assumed that the flying machine which will really fly might be evolved by the combined and continuous efforts of mathematicians and mechanicians in from one million to ten million years–provided, of course, we can meanwhile eliminate such little drawbacks and embarrassments as the existing relation between weight and strength in inorganic materials.Just two months after this rather optimisitic opinion was published, it would turn out to be just two brothers in their thirties (who were bicycle retailers), not a large corporation or a government research institution; who would inaugurate the aviation industry by creating the Wright Flyer. By questioning the fundamentals of flight mechanics, they managed to create something which was thought to be unfeasible, in just four years - a life-changing use of first principles thinking.",
            "content_html": "<h4 id=\"background\">Background</h4><p>The other day when I was reading an article on reasoning from first principles, I came across this statement which I found interesting-</p><blockquote>  <p>Children instinctively think in first principles.</p></blockquote><p>Dwelling on this, I realised how much I have begun to reason by analogy lately (and use my preconceived notions), which I believe, has hindered my ability to have a confident outlook on approaching problems. And in hindsight does make me feel a little incompetent, because it shows that I am trying to approach a problem by trying to depend on some prior experience, rather than having a complete understanding of each bit and constructing the solution myself.</p><h4 id=\"do-not-accept\">Do not accept</h4><p>A first principle is a statement which cannot be derived from another statement, meaning an absolute truth which cannot be broken down further; the mathematical equivalent being postulates. Reasoning by first principles is basically a problem solving methodology that forces a person to start from absolute zero, not relying on any assumptions, analogies and experiences. In simple terms, questioning everything and getting to the root of the problem.</p><p>I remember pestering my parents by asking them questions about anything and everything that caught my attention. I had a phase when I was about five where all I did was ask non-stop <em>whys</em> and <em>hows</em> for every little thing. This might be a naive example of first principles thinking, but it still (kind of) proves that I wanted to get to the bottom of something. While you don’t have to pester your friends and family with a barrage of <em>whys</em> as an adult, I think there are a few important takeaways from this inquisitive nature of children. Firstly, the more obvious one being the need to understand purpose of doing something, or something existing. Secondly, intellectual humility. I believe this applies more for older individuals, as young children have no fear of looking ‘stupid’ in admitting they do not know something (as evidenced by their bombardment of a hundred <em>whys</em> per day). But this way of approaching things like a child gives a greater mastery over whatever problem you are trying to tackle, considering the fact that you have a clear picture on the fundamentals, and forces the mind to think logically.</p><p>One situation where first principles thinking was taught was in high school mathematics. The proofs we had to deal with in Euclidian Geometry is a good example of utilising the first principles thinking, where we were only given Euclid’s postulates and axioms. I remember I was pretty decent at high school math, and found the theorems very interesting to prove using just the foundations (first principles). Just as there are multiple ways to solve the same math question, the idea of breaking down a problem into a set of the tiniest rules possible also gives way to solve it using more than one method or approach, introducing fresh perspectives, rather than fixating on old experiences which serve as a limiter in this situation. This also leads to the discussion of experience hindering innovation which I will touch upon in the next section.</p><p>I believe one of the best applications of first principles thinking is by René Descartes, the famous quote, <em>cogito, ergo sum</em> in his <em>Discourse on the Method</em>, which serves as a foundational statement in Western philosophy. He tries to tackle skepticism by finding an absolute truth which is irrefutable. He does so by doubting everything around him, the World, its people, nature, environment, and his own body. He starts by imagining a situation where his thoughts are being manipulated into thinking all these things exist in his mind, and aren’t real. By refuting it all, he removes all preconceived notions, and starts from a blank slate. I’ll let him explain the rest:</p><blockquote>  <p>But immediately upon this I observed that, whilst I thus wished to think that all was false, it was absolutely necessary that I, who thus thought, should be something; And as I observed that this truth, <strong>I think, therefore I am</strong>, … I concluded that I might, without scruple, accept it as the first principle of the philosophy of which I was in search.</p></blockquote><p>While first principles is a popular technique used in mathematics and physics (<em>ab initio</em> methods), it is used in various forms of arts as well. I think one of the places where you can see this, but not as discernible is with music. A cover or a remix is a modified version of a song which already exists, and an original song with a distinct style is a newly invented sound manages to scratch an itch in the brain. A good artist is someone who can create songs on their own by mastering music theory fundamentals like rhythm, melody, pitch, etc. Rather than relying on getting inspired (i.e: ripping off) from another person they tend to create their own art. Another popular example is a chef versus a cook. A cook relies on recipes, and might make a few variations and improve it slightly, while a chef is someone who has a complete understanding of the ingredients and its sciences, and can create new recipes from scratch.</p><p>I think one of the best advices I’ve got in college from a professor of mine was to ‘never accept’ what he teaches without verifying it ourselves. This is an important philosophy when learning something new. Accepting something at face value without knowing the nuances and the <em>whys</em> and <em>hows</em> was something he was heavily against. We were told to ‘not trust’ him every time he introduced a new topic and reached the conclusion. Generally the class (<em>Automata Theory</em>, for those interested) was a discussion in which we started with absolute facts and worked our way to prove something or find a solution. This distinct style of teaching in which the professor, rather than just stating the theorems and its proofs, started off with the same level of knowledge as the students, and the discussions helped introduce a lot of new directions to approach a problem. (I’ve still not forgotten most of the concepts because I am so fundamentally clear about it.)</p><h4 id=\"beginners-mind-paradox\">Beginner’s Mind Paradox</h4><p>The more you know about a subject, the more likely you are to close your mind to further learning (<em>see: Einstellung effect</em>). This paradox implies that beginner is more likely to be inventive as they are more likely to be open to trying things which are either considered unconventional, or haven’t been thought of before. So, innovation often stems from those who are ignorant of established rules and guidelines. And as we age, we tend to become conformists (probably due to experience). I think this also carries over in education, where as you grow older, the vastness of information and the complexity of the subjects we learn tend to be intimidating. But in reality, all complex systems can be reverse engineered into simple truths. And though this takes more effort, realising the simple beauties of things you’re learning tends to make you appreciate the subject more. Children always have a strong grasp over things they want to learn, and are persistent to get to the bottom of it. They focus on the simple things among the complex chaos more clearly than adults, and this comes to them intuitively. This is a trait that I believe is fully developed in everyone since birth. They appreciate the simplicity and do not get distracted by the difficulty, social implications, failure rate - things which are irrelevant and always lead to bias and narrow-mindedness, present in most if not all adults. Skills you have learned as a child are seldom forgotton even after many years. It’s almost as if you know it instinctively. The way to open up your mind again is use first principles thinking, and do not let bias take over.</p><p>The <em>New York Times</em> published an editorial on October 9th, 1903, titled: <em>FLYING MACHINES WHICH DO NOT FLY.</em> It poked fun at the unsuccessful attempt to create the first working manned heavier-than-air aircraft by Samuel Langley, which had crashed just two days before this editorial was published, leading to this quote-</p><blockquote>  <p>Hence, if it requires, say, a thousand years to fit for easy flight a bird which started with rudimentary wings, or ten thousand for one with started with no wings at all and had to sprout them ab initio, <strong>it might be assumed that the flying machine which will really fly might be evolved by the combined and continuous efforts of mathematicians and mechanicians in from one million to ten million years</strong>–provided, of course, we can meanwhile eliminate such little drawbacks and embarrassments as the existing relation between weight and strength in inorganic materials.</p></blockquote><p>Just two months after this rather <em>optimisitic</em> opinion was published, it would turn out to be just two brothers in their thirties (who were bicycle retailers), not a large corporation or a government research institution; who would inaugurate the aviation industry by creating the <em>Wright Flyer</em>. By questioning the fundamentals of flight mechanics, they managed to create something which was thought to be unfeasible, <em>in just four years</em> - a life-changing use of first principles thinking.</p>",
            "url": "http://localhost:4000/2025/03/12/apriori",
            
            
            
            "tags": ["psychology","philosophy"],
            
            "date_published": "2025-03-12T00:00:00+00:00",
            "date_modified": "2025-03-12T00:00:00+00:00",
            
                "author":  {
                "name": "Rohan",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/2025/02/23/consumption",
            "title": "Growing out of the consumption trap",
            "summary": null,
            "content_text": "Maybe mom, dad are right; it is the phone.Lately I’ve been feeling dependent on consumption. What I mean is, there is a constant need to feed my brain with information, important or not, while not working for it. There is a need for instant gratification. Creativity is being suppressed. I am constantly looking for answers everywhere else, but not taking a step back and looking within. I cannot speak for all, but I know for a fact that majority of the world falling victim to the same consumption trap.Not thinking anymoreI remember the time when I was young, maybe ten to twelve years ago, when young Rohan had nothing better to do, I’d just take a sheet of paper and start painting something. I had this mindless obsession where I would just sit for hours losing track of time doing things that felt, in hindsight, therapeutic. I used to love building things, like structures out of legos, cardboard, etc. I distinctly remember creating a diamond sword (from Minecraft), and a Fire Smasher (Power Rangers Samurai). All of these experiences I would probably never have if I was born a few years in the future. I was free back then. Even the times I would use my PC, which I had access to since I was four years old, it didn’t interest me to watch videos all day and consume content. I had the curious tendency to tinker with configurations of games and applications, play around with websites I made, all things which forced me into getting my hands dirty and express my creativity. Now, due to everything being digitized, and the amount of captivating short-form content online, I feel an urge to constantly check my phone, to the point where it is the only thing I do.A person’s mind is dependent on constant inflow of external information, consuming as much content as possible without having the need to analyze and reflect even for a second. Modern media, which is so focused on shorter, attention grabbing content, as if spoonfeeding and chewing the food for another person just to swallow it, has directly contributed to the inability of creative thinking; or thinking in general.Modern media - the bad outweighs the goodBoth consumption and creation are important. Learning from the experiences of other people is as important as being by yourself and reflecting. What matters is the type of content that is being consumed. Reading is a form of consumption as well, and there is a cognitive effort to concentrate and contemplate, indirectly helping improve creativity by introducing new perspectives. Movies, I believe, are an entertaining form of learning culture and history. Music calms the soul. There is no doubt that there are good sources of entertainment. Of course, moderation matters, but that is irrelevant to this discussion.The progress of humanity has always led to reduction of human effort as much as possible. But going after the mind is vicious. Mental exercise is key for the mind to grow, and the lesser effort the mind puts in, the lazier it will get. This has dangerous implications. A lazy mind leads to loss of creativity, originality and drive. The way short-form content works is exactly this. It is just one piece of media after the other, continuous stream of information, with no breaks to process it, with no purpose, just random bits of information that is interesting and will captivate the mind using instant gratification. These bits of information, unlikely to be remembered a few minutes after watching it, is just information overload. The mind loses focus, serves no purpose, and gradually becomes dependent on this to even function.Education and technologyThe idea of spending time figuring a thing out from scratch is now considered time wasted, probably because there is an answer for everything. The growing consensus is against ‘reinventing the wheel’. Information is universal, owing to the massive surge in Internet access. The Open-source movement has also been a huge contributor to providing access to resources that are a treasure trove of information. The advancements in technology have certainly improved the quality of life, especially so in healthcare and science, but in education we have come to a point where it is beginning to do more harm than good.From schoolwork to university assigments, everything is just a search away. We find the exact question we want on some online forum. And even if we don’t, the next obvious step is to use LLMs. These LLMs now are so good that it can solve most undergraduate-level university questions with ease, at least in Science and Engineering. I would say it could do better than 95% of my class right now. Point is, we are not giving our brain breathing space to step back and think for a second. Of course, it is going to take a lot more time to get the answer you are looking for, but it opens up this creative pathway in your mind, where it makes you capable to think logically and reach to the answer or conclusion yourself. And this is the pathway to innovation. No matter how much these LLMs help you, it will never have a single original thought.Ingenuity is the beauty of the human mind.Be alone and thinkI’ve blabbered about what and why consumption is bad, but what can be done about it? These are a few things that I have been trying to do-Being alone. I mean absolutely alone. Sometimes I like to take a break from the world and just think. Think about where I’ve come from, my story so far, memories that I enjoy, memories that I didn’t. Everything. It just humbles me so much and motivates me to work on the present.  “People talk to you a great deal about your education, but some good, sacred memory, preserved from childhood, is perhaps the best education.” - Dostoevsky, The Brothers KaramazovI’ve noticed that as I grew older, my mind has been getting piled up and racing with thoughts all the time, so it’s a good idea to step back and reflect. I guess this is what meditation is.I read more often, and have started to write, giving my brain a good workout, helping me think more. I believe expressing yourself, be it music, arts, writing, is an amazing way of opening up your mind and soul, and gives birth to inspiration and inventiveness in everyday life as well. Learning a new skill (in my case, writing) keeps you occupied and married to the journey of betterment, and helps to discover your true self in the process, and has definitely helped me reduce the need for mindless consumption.",
            "content_html": "<h4 id=\"maybe-mom-dad-are-right-it-is-the-phone\">Maybe mom, dad are right; it is the phone.</h4><p>Lately I’ve been feeling dependent on <em>consumption</em>. What I mean is, there is a constant need to feed my brain with information, important or not, while not working for it. There is a need for instant gratification. Creativity is being suppressed. I am constantly looking for answers everywhere else, but not taking a step back and looking within. I cannot speak for all, but I know for a fact that majority of the world falling victim to the same consumption trap.</p><h4 id=\"not-thinking-anymore\">Not thinking anymore</h4><p>I remember the time when I was young, maybe ten to twelve years ago, when young Rohan had nothing better to do, I’d just take a sheet of paper and start painting something. I had this mindless obsession where I would just sit for hours losing track of time doing things that felt, in hindsight, therapeutic. I used to love building things, like structures out of legos, cardboard, etc. I distinctly remember creating a diamond sword (from Minecraft), and a Fire Smasher (Power Rangers Samurai). All of these experiences I would probably never have if I was born a few years in the future. I was free back then. Even the times I would use my PC, which I had access to since I was four years old, it didn’t interest me to watch videos all day and <em>consume</em> content. I had the curious tendency to tinker with configurations of games and applications, play around with websites I made, all things which forced me into getting my hands dirty and express my <em>creativity</em>. Now, due to everything being digitized, and the amount of captivating short-form content online, I feel an urge to constantly check my phone, to the point where it is the only thing I do.</p><p>A person’s mind is dependent on constant inflow of external information, consuming as much content as possible without having the need to analyze and reflect even for a second. Modern media, which is so focused on shorter, attention grabbing content, as if spoonfeeding and chewing the food for another person just to swallow it, has directly contributed to the inability of creative thinking; or thinking in general.</p><h4 id=\"modern-media---the-bad-outweighs-the-good\">Modern media - the bad outweighs the good</h4><p>Both consumption and creation are important. Learning from the experiences of other people is as important as being by yourself and reflecting. What matters is the type of content that is being consumed. Reading is a form of consumption as well, and there is a cognitive effort to concentrate and contemplate, indirectly helping improve creativity by introducing new perspectives. Movies, I believe, are an entertaining form of learning culture and history. Music calms the soul. There is no doubt that there are good sources of entertainment. Of course, moderation matters, but that is irrelevant to this discussion.</p><p>The progress of humanity has always led to reduction of human effort as much as possible. But going after the mind is vicious. Mental exercise is key for the mind to grow, and the lesser effort the mind puts in, the lazier it will get. This has dangerous implications. A lazy mind leads to loss of creativity, originality and drive. The way short-form content works is exactly this. It is just one piece of media after the other, continuous stream of information, with no breaks to process it, with no purpose, just random bits of information that is interesting and will captivate the mind using instant gratification. These bits of information, unlikely to be remembered a few minutes after watching it, is just information overload. The mind loses focus, serves no purpose, and gradually becomes dependent on this to even function.</p><h4 id=\"education-and-technology\">Education and technology</h4><p>The idea of spending time figuring a thing out from scratch is now considered time wasted, probably because there is an answer for everything. The growing consensus is against ‘reinventing the wheel’. Information is universal, owing to the massive surge in Internet access. The Open-source movement has also been a huge contributor to providing access to resources that are a treasure trove of information. The advancements in technology have certainly improved the quality of life, especially so in healthcare and science, but in education we have come to a point where it is beginning to do more harm than good.</p><p>From schoolwork to university assigments, everything is just a search away. We find the exact question we want on some online forum. And even if we don’t, the next obvious step is to use LLMs. These LLMs now are so good that it can solve most undergraduate-level university questions with ease, at least in Science and Engineering. I would say it could do better than 95% of my class right now. Point is, we are not giving our brain breathing space to step back and think for a second. Of course, it is going to take a lot more time to get the answer you are looking for, but it opens up this creative pathway in your mind, where it makes you capable to think logically and reach to the answer or conclusion yourself. And this is the pathway to innovation. No matter how much these LLMs help you, it will never have a single original thought.</p><p>Ingenuity is the beauty of the human mind.</p><h4 id=\"be-alone-and-think\">Be alone and think</h4><p>I’ve blabbered about what and why consumption is bad, but what can be done about it? These are a few things that I have been trying to do-</p><p><em>Being alone</em>. I mean absolutely alone. Sometimes I like to take a break from the world and just think. Think about where I’ve come from, my story so far, memories that I enjoy, memories that I didn’t. Everything. It just humbles me so much and motivates me to work on the present.</p><blockquote>  <p>“People talk to you a great deal about your education, but some good, sacred memory, preserved from childhood, is perhaps the best education.” - Dostoevsky, The Brothers Karamazov</p></blockquote><p>I’ve noticed that as I grew older, my mind has been getting piled up and racing with thoughts all the time, so it’s a good idea to step back and reflect. I guess this is what meditation is.</p><p>I read more often, and have started to write, giving my brain a good workout, helping me think more. I believe expressing yourself, be it music, arts, writing, is an amazing way of opening up your mind and soul, and gives birth to inspiration and inventiveness in everyday life as well. Learning a new skill (in my case, writing) keeps you occupied and married to the journey of betterment, and helps to discover your true self in the process, and has definitely helped me reduce the need for mindless consumption.</p>",
            "url": "http://localhost:4000/2025/02/23/consumption",
            
            
            
            "tags": ["technology","lifestyle"],
            
            "date_published": "2025-02-23T00:00:00+00:00",
            "date_modified": "2025-02-23T00:00:00+00:00",
            
                "author":  {
                "name": "Rohan",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}